* 2 iteration
** TODO cleanup address from the source
** TODO listing of schools with no address
** TODO droping schools like lombos form the map
** TODO don't allow user to zoom in map past a certain point
** TODO New centroid Rules
** TODO - [ ] box-shadow issues and bring back the div separator
** DONE styling remarks (Pairing with Giulia)
   :LOGBOOK:
   CLOCK: [2022-05-20 Fri 15:28]--[2022-05-20 Fri 16:04] =>  0:36
   CLOCK: [2022-05-20 Fri 14:44]--[2022-05-20 Fri 15:18] =>  0:34
   CLOCK: [2022-05-20 Fri 12:47]--[2022-05-20 Fri 13:00] =>  0:13
   CLOCK: [2022-05-20 Fri 11:46]--[2022-05-20 Fri 12:28] =>  0:42
   CLOCK: [2022-05-20 Fri 09:31]--[2022-05-20 Fri 10:45] =>  1:14
   CLOCK: [2022-05-18 Wed 10:26]--[2022-05-18 Wed 14:53] =>  4:27
   :END:
Things for me to do



- [ ] footer location issue on ipad (Giulia will look into this wtv.)


- [X] box shadow remove radius
- [X] remove footer.home class from home page

** DONE index page multilang support
   :LOGBOOK:
   CLOCK: [2022-05-13 Fri 15:05]--[2022-05-13 Fri 15:54] =>  0:49
   :END:
*** DONE rework multilang system

*** DONE [SEO] "en" url structure
    :LOGBOOK:
    CLOCK: [2022-05-23 Mon 18:02]--[2022-05-23 Mon 18:45] =>  0:43
    CLOCK: [2022-05-23 Mon 16:53]--[2022-05-23 Mon 18:02] =>  1:09
    CLOCK: [2022-05-23 Mon 15:54]--[2022-05-23 Mon 16:11] =>  0:17
    :END:

** TODO [SEO] htaccess rules for canonical urls, www and https vs http 2 hours
** TODO COPY, page generator and pages (3 days)
   Generate a page from a Markdown to hiccup
*** TODO Bits and bobs around the website
    :LOGBOOK:
    CLOCK: [2022-05-27 Fri 10:35]--[2022-05-27 Fri 11:06] =>  0:31
    CLOCK: [2022-05-27 Fri 09:59]--[2022-05-27 Fri 10:30] =>  0:31
    CLOCK: [2022-05-27 Fri 09:12]--[2022-05-27 Fri 09:43] =>  0:31
    :END:


*** DONE Build generator (1 day)
    :LOGBOOK:
    CLOCK: [2022-05-22 Sun 19:39]--[2022-05-22 Sun 20:14] =>  0:35
    :END:
Read a markdown and strip html

*** TODO about
    :LOGBOOK:
    CLOCK: [2022-05-26 Thu 12:46]--[2022-05-26 Thu 12:55] =>  0:09

    :END:
*** TODO What Can we infer by the data

*** TODO methodology
    :LOGBOOK:
    CLOCK: [2022-05-26 Thu 12:55]--[2022-05-26 Thu 13:49] =>  0:54
    :END:

*** TODO OS
*** TODO Privacy

*** TODO explainer page on the past projects
    :LOGBOOK:
    CLOCK: [2022-05-25 Wed 15:32]--[2022-05-25 Wed 16:07] =>  0:35
    CLOCK: [2022-05-25 Wed 11:39]--[2022-05-25 Wed 12:31] =>  0:52
    CLOCK: [2022-05-24 Tue 18:09]--[2022-05-24 Tue 18:20] =>  0:11
    CLOCK: [2022-05-24 Tue 17:47]--[2022-05-24 Tue 18:09] =>  0:22
    CLOCK: [2022-05-24 Tue 16:52]--[2022-05-24 Tue 17:47] =>  0:55
    CLOCK: [2022-05-24 Tue 14:42]--[2022-05-24 Tue 16:52] =>  2:10
    :END:


** DONE disable input/enable when JS is loaded

** DONE color palette
   :LOGBOOK:
   CLOCK: [2022-05-18 Wed 18:15]--[2022-05-18 Wed 18:47] =>  0:32
   CLOCK: [2022-05-18 Wed 16:01]--[2022-05-18 Wed 18:15] =>  2:14
   :END:
** DONE footer style
   :LOGBOOK:
   CLOCK: [2022-05-18 Wed 19:02]--[2022-05-18 Wed 19:19] =>  0:17
   :END:

- [X] box-shadow new colors
- [X] suggestions colors
- [X] and suggestion box height

** DONE display logo
** DONE suggestion styling
*** DONE display round markers
*** DONE diplay info on marker click

** DONE school listing fixes
*** DONE Style listing page
    :LOGBOOK:
    CLOCK: [2022-05-19 Thu 14:20]--[2022-05-19 Thu 14:37] =>  0:17
    :END:
- [X] First pass
- [X] finish stylings

*** DONE single school page
    :LOGBOOK:
    CLOCK: [2022-05-19 Thu 19:54]--[2022-05-19 Thu 20:26] =>  0:32
    CLOCK: [2022-05-19 Thu 16:45]--[2022-05-19 Thu 18:53] =>  2:08
    CLOCK: [2022-05-19 Thu 15:21]--[2022-05-19 Thu 15:42] =>  0:21
    CLOCK: [2022-05-19 Thu 15:00]--[2022-05-19 Thu 15:21] =>  0:21
    :END:

*** DONE style ratings

    :LOGBOOK:
    CLOCK: [2022-05-17 Tue 15:50]--[2022-05-17 Tue 22:19] =>  6:29
    CLOCK: [2022-05-17 Tue 14:15]--[2022-05-17 Tue 15:50] =>  1:35
    :END:

*** DONE POP UP
    :LOGBOOK:
    CLOCK: [2022-05-19 Thu 12:07]--[2022-05-19 Thu 12:26] =>  0:19
    CLOCK: [2022-05-19 Thu 11:26]--[2022-05-19 Thu 11:46] =>  0:20
    CLOCK: [2022-05-19 Thu 10:41]--[2022-05-19 Thu 11:26] =>  0:45
    CLOCK: [2022-05-19 Thu 09:33]--[2022-05-19 Thu 10:37] =>  1:04
    CLOCK: [2022-05-19 Thu 09:00]--[2022-05-19 Thu 09:33] =>  0:33
    :END:

** DONE bits and bobs style fixes
   :LOGBOOK:
   CLOCK: [2022-05-16 Mon 16:28]--[2022-05-16 Mon 16:37] =>  0:09
   :END:
- home padding, input box and back arraw color
- colapse nav left

** DONE underline only current page
   :LOGBOOK:
   CLOCK: [2022-05-16 Mon 16:21]--[2022-05-16 Mon 16:28] =>  0:07
   :END:

** DONE no results found error message
** DONE expand search in mobile
   :LOGBOOK:
   CLOCK: [2022-05-15 Sun 09:15]--[2022-05-15 Sun 10:10] =>  0:55
   :END:
** DONE back button functionality in mobile
   :LOGBOOK:
   CLOCK: [2022-05-15 Sun 10:11]--[2022-05-15 Sun 11:53] =>  1:42
   :END:

** DONE omited results info

* DONE Roadmap
#+CAPTION: Clock summary at [2022-05-13 Fri 13:03]
| Headline                                    | Time       |         |
|---------------------------------------------+------------+---------|
| *Total time*                                | *4d 12:04* |         |
|---------------------------------------------+------------+---------|
| Roadmap                                     | 4d 12:04   |         |
| \_  Markup basics 6:15                      |            |    6:14 |
| \_  Multilanguage support PT/EN             |            |    2:41 |
| \_  listing page                            |            |    3:14 |
| \_  load 2014 data with addresses on the... |            |    0:28 |
| \_  routing                                 |            |    8:01 |
| \_  Get entire dataset in the app           |            |    7:44 |
| \_  Get address and lat/long                |            |   15:36 |
| \_  produce new listings (1 h) 0:42         |            |    0:42 |
| \_  ADD cp7 coord (0:30) 8h - 1 1/2 days    |            |    8:09 |
| \_  produce svg with ratings 2 days         |            |    0:20 |
| \_  parse and import PDFs                   |            | 2d 5:01 |
| \_  Productionize                           |            |    1:54 |
#+END:




** DONE Markup basics 6:15
   :LOGBOOK:
   CLOCK: [2022-04-11 Mon 12:11]--[2022-04-11 Mon 12:14] =>  0:03
   CLOCK: [2022-04-11 Mon 12:06]--[2022-04-11 Mon 12:10] =>  0:04
   CLOCK: [2022-04-11 Mon 10:11]--[2022-04-11 Mon 11:09] =>  0:58
   CLOCK: [2022-04-10 Sun 20:07]--[2022-04-10 Sun 20:23] =>  0:16
   CLOCK: [2022-04-10 Sun 19:16]--[2022-04-10 Sun 20:06] =>  0:50
   CLOCK: [2022-04-09 Sat 11:58]--[2022-04-09 Sat 13:03] =>  1:05
   CLOCK: [2022-04-08 Fri 17:47]--[2022-04-08 Fri 18:47] =>  1:00
   CLOCK: [2022-04-08 Fri 16:21]--[2022-04-08 Fri 16:48] =>  0:27
   CLOCK: [2022-04-08 Fri 11:41]--[2022-04-08 Fri 12:20] =>  1:39
   CLOCK: [2022-04-08 Fri 10:09]--[2022-04-08 Fri 11:01] =>  0:52
   :END:
   - [X] generic style page

   - [X] footer
   - [X] header

   - [X] listing
   - [X] index

   - [X] buttons

   - [X] lang switches?

   - [ ] +graphs and visualizations (for ratings)+
     not doing now
** DONE get a working name
** DONE Multilanguage support PT/EN
*** DONE basic solution
*** DONE language flag toggle
    :LOGBOOK:
    CLOCK: [2022-04-11 Mon 16:36]--[2022-04-11 Mon 17:32] =>  0:56
    CLOCK: [2022-04-11 Mon 15:35]--[2022-04-11 Mon 16:04] =>  0:29
    CLOCK: [2022-04-11 Mon 12:19]--[2022-04-11 Mon 13:35] =>  1:16
    :END:
I think these two tasks cover the language requirements. Now it's just a matter of adding content in multilanguage
** DONE listing page
*** DONE load listing data
    :LOGBOOK:
    CLOCK: [2022-04-05 Tue 15:59]--[2022-04-05 Tue 16:35] =>  0:36
    :END:

*** DONE Bundle leaflet
    :LOGBOOK:
    CLOCK: [2022-04-07 Thu 16:50]--[2022-04-07 Thu 17:51] =>  1:01
    :END:

*** DONE Display basic map
*** DONE display listing with addresses
    :LOGBOOK:
    CLOCK: [2022-04-05 Tue 16:46]--[2022-04-05 Tue 17:07] =>  0:21
    :END:
*** DONE Display markers and centre the map 1:20
    :LOGBOOK:
    CLOCK: [2022-04-07 Thu 21:32]--[2022-04-07 Thu 22:33] =>  1:01
    :END:
*** DONE load 30 school and check permliminary performance
    :LOGBOOK:
    CLOCK: [2022-04-07 Thu 20:53]--[2022-04-07 Thu 21:08] =>  0:15
    :END:

** DONE load 2014 data with addresses on the cgi/clj script (28 min)
   :LOGBOOK:
   CLOCK: [2022-04-11 Mon 21:59]--[2022-04-11 Mon 22:02] =>  0:03
   CLOCK: [2022-04-11 Mon 21:32]--[2022-04-11 Mon 21:57] =>  0:25
   :END:
*** TODO create bb task that parses the json and spits schools
*** TODO places list needs a display tag for municipio/district/etc
*** TODO Massage municipality of schools?
** DONE places autocomplete (1h)

   places list gets loaded in the frontend and is used for autocomplete. No need to fetch the server
*** DONE styling
*** DONE edn file with names
*** DONE list of places
*** DONE lib that gets sugestions main/query-place-list
*** DONE place-match functionality  in frontend
** DONE routing
   - original extimate: 30
   - actual time: took a few attemps to get it right
   :LOGBOOK:
   CLOCK: [2022-04-19 Tue 10:53]--[2022-04-19 Tue 12:16] =>  1:23
   CLOCK: [2022-04-18 Mon 18:49]--[2022-04-18 Mon 21:32] =>  2:43
   CLOCK: [2022-04-13 Wed 10:09]--[2022-04-13 Wed 11:12] =>  1:03
   CLOCK: [2022-04-12 Tue 17:13]--[2022-04-12 Tue 18:14] =>  1:01
   CLOCK: [2022-04-12 Tue 10:20]--[2022-04-12 Tue 12:11] =>  1:51
   :END:

*** DONE 404
*** DONE basic autocomplete flow
*** DONE icons/styling
*** DONE generate links from k
** DONE frontend page (1h)
*** DONE Language selector (20 min)
*** DONE bottom section (30 min)** TODO Data parsing (1h)
   parse a json file into the directory structure
** DONE Hosting
   1 day for setting up and what not
   1 day to make it happen

** DONE display ratings (3 days)
   Parsing data took about 3 weeks
** DONE Get entire dataset in the app
   :LOGBOOK:
   CLOCK: [2022-05-09 Mon 09:37]--[2022-05-09 Mon 15:15] =>  5:38
   CLOCK: [2022-05-06 Fri 10:28]--[2022-05-06 Fri 11:11] =>  0:43

   :END:
   - nec->ratings
   - nec-> addresses + names +  postcodes + district + concelho
   - cp7->lat/long
   - produce new district/concelho collection

*** +Refactoring+
    :LOGBOOK:
    CLOCK: [2022-05-04 Wed 18:20]--[2022-05-04 Wed 19:43] =>  1:23
    :END:

** DONE Get address and lat/long
   :LOGBOOK:
   CLOCK: [2022-05-03 Tue 15:14]--[2022-05-03 Tue 16:03] =>  0:49
   CLOCK: [2022-05-03 Tue 12:17]--[2022-05-03 Tue 13:30] =>  1:13
   CLOCK: [2022-05-02 Mon 18:17]--[2022-05-02 Mon 19:38] =>  1:21
   CLOCK: [2022-05-02 Mon 17:13]--[2022-05-02 Mon 18:16] =>  1:03
   CLOCK: [2022-05-01 Sun 10:19]--[2022-05-01 Sun 10:43] =>  0:24
   CLOCK: [2022-04-29 Fri 14:28]--[2022-04-29 Fri 16:47] =>  2:19
   CLOCK: [2022-04-29 Fri 11:14]--[2022-04-29 Fri 12:43] =>  1:29
   CLOCK: [2022-04-28 Thu 17:00]--[2022-04-28 Thu 18:06] =>  1:06
   CLOCK: [2022-04-28 Thu 10:19]--[2022-04-28 Thu 11:13] =>  0:54
   CLOCK: [2022-04-26 Tue 16:21]--[2022-04-26 Tue 17:37] =>  1:16
   :END:

   - [X] enrich with lat/long

   - [X] script for raw addresses
   - [X] enrich with raw details
   - [X] get postcode column

   - [ ] enrich with junta

*** DONE propagate new data format to places
    :LOGBOOK:
    CLOCK: [2022-05-10 Tue 22:09]--[2022-05-10 Tue 23:04] =>  0:55
    CLOCK: [2022-05-10 Tue 16:08]--[2022-05-10 Tue 17:53] =>  1:45
    :END:

    - [X] concelho lict
    - [X] district list
    - [X] school list

*** DONE first pass of server side rendering 2 half days
    :LOGBOOK:
    CLOCK: [2022-04-14 Thu 10:40]--[2022-04-14 Thu 11:42] =>  1:02
    :END:
** TODO clean up address in import scripts 1 h
** DONE produce new listings (1 h) 0:42
   :LOGBOOK:
   CLOCK: [2022-05-11 Wed 11:04]--[2022-05-11 Wed 11:46] =>  0:42
   :END:
** DONE ADD cp7 coord (0:30) 8h - 1 1/2 days
   :LOGBOOK:
   CLOCK: [2022-05-12 Thu 14:49]--[2022-05-12 Thu 15:32] =>  0:43
   CLOCK: [2022-05-12 Thu 09:42]--[2022-05-12 Thu 12:33] =>  2:51
   CLOCK: [2022-05-11 Wed 21:56]--[2022-05-12 Thu 00:08] =>  2:12
   CLOCK: [2022-05-11 Wed 16:53]--[2022-05-11 Wed 17:13] =>  0:20
   CLOCK: [2022-05-11 Wed 16:00]--[2022-05-11 Wed 16:45] =>  0:45
   CLOCK: [2022-05-11 Wed 13:37]--[2022-05-11 Wed 14:55] =>  1:18
   :END:

   - map cp7->coord
   - check how many of the total cp7 you made
   - check how many imtprofiles are there left to be added coord

** DONE produce svg with ratings 2 days
*** DONE add routing for concelhos
    :LOGBOOK:
    CLOCK: [2022-05-12 Thu 16:54]--[2022-05-12 Thu 17:00] =>  0:06
    :END:

*** DONE listing first paint
*** DONE show schools list
    :LOGBOOK:
    CLOCK: [2022-05-12 Thu 17:11]--[2022-05-12 Thu 17:23] =>  0:12
    :END:

*** DONE display raw coords
*** DONE calc centroid
*** DONE display nec
    :LOGBOOK:
    CLOCK: [2022-05-12 Thu 17:33]--[2022-05-12 Thu 17:35] =>  0:02
    :END:

*** DONE Display bars with full data
    - Theory bar
    - Driving bar
    - display value for each bar
    - Legend
    - display done somewhere
** TODO Scale svg 1 h
    https://css-tricks.com/scale-svg/

** DONE parse and import PDFs
    :LOGBOOK:
    CLOCK: [2022-04-19 Tue 15:33]--[2022-04-20 Wed 17:12] => 25:39
    CLOCK: [2022-04-20 Wed 11:20]--[2022-04-20 Wed 13:33] =>  2:13
    CLOCK: [2022-04-19 Tue 09:01]--[2022-04-20 Wed 10:10] => 25:09
    :END:
- [X] Parse tables
- [X] more quality control

  parse other columns

- [X] export pdf
- [X] store everything as pickle

** TODO style listing page 1 h (other than ratings svg)
** TODO Productionize
   - [X] shadow builds and proper css setup
   - [X] css build
   - [X] leaflet css
   - [X] leaflet js
   :LOGBOOK:
   CLOCK: [2022-04-18 Mon 15:19]--[2022-04-18 Mon 16:00] =>  0:41
   CLOCK: [2022-04-18 Mon 10:47]--[2022-04-18 Mon 12:00] =>  1:13
   :END:


** Technical/setup stuff
*** TODO Bunde css into less files

  - [X] how to require namespaces
  - [X] private github account
  - [X] cider repl with babashka setup
  - [X] slurp pdf

  - [X] shadow-clj build for frontend
  - [X] Workspaces build
  - [X] browser hot reload
  - +Address search box+
  - https://www.geoapify.com/pricing
  - https://leafletjs.com/SlavaUkraini/examples.html

  - [X] css pipeline
    - [X] basic less pipeline
    - [X] file watcher
    - +babashka file watcher+


 * Postal datasets

  - https://github.com/dssg-pt/mp-mapeamento-cp7
    (depende de duminio)
  - https://github.com/temospena/CP7
    (lat/long depends on cusco)
  - https://www.duminio.com/ptcp/
    (lat/long depends on?)
  - https://github.com/cusco/ctt
    (gmaps)
  - [[https://www.ctt.pt/feapl_2/app/open/postalCodeSearch/postalCodeSearch.jspx][CTT]]
    11;06;21696;Lisboa;49230611;Rua;;;;Vale Formoso;;Pares de 24 a 80B;;;1950;283;LISBOA
    Sem grande informacao.
  - https://snig.dgterritorio.gov.pt/rndg/srv/search?createDateYear=1990
    returns 500
  - http://www.geonames.org/postal-codes/postal-codes-portugal.html
    poor presition

  - lista q n serve para muito
    https://geodivagar.appspot.com/
  - https://codigopostal.ciberforma.pt/

** COMMENT ESRI api
   #
   Can I use it for my needs? yup
   Can I publish the data?
   How to pull data yup
   What's in it yup

* Nominatim

https://github.com/mediagis/nominatim-docker/tree/master/4.0

docker run -it --rm -d \
  -e PBF_URL=https://download.geofabrik.de/europe/portugal-latest.osm.pbf \
  -e REPLICATION_URL=https://download.geofabrik.de/europe/portugal-updates/ \
  -p 8080:8080 \
  --name nominatim \
  mediagis/nominatim:4.0

http://localhost:8080/search.php?q=rua%20vale%20formoso
Docs: https://nominatim.org/release-docs/latest/api/Search/

* Data issues
** Non data issues

*** 2020
   calculated average rate matches but done and scheduled doesn't match

*** 2018 1 exam is missing

** check the cp7 map file because some postcodes come from god know were
